docs/arbel.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-04 Wed 15:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ARBEL</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Zach Flynn" />
<meta name="description" content="ARBEL is a registry-based environment and language. It is &quot;generic-by-default&quot; and is centered around a single flexible data structure: the registry (a hash table).  This manual describes how to use the language."
 />


</head>
<body>
<div id="preamble" class="status">
ARBEL<br>Zach Flynn<br>2019-12-04 Wed 15:03
</div>
<div id="content">
<h1 class="title">ARBEL</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0a19359">1. Introduction</a></li>
<li><a href="#org955a4b5">2. The Basics</a>
<ul>
<li><a href="#org350dc15">2.1. Statements and syntax</a></li>
<li><a href="#orgd71b3f3">2.2. Registers and registries</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org0a19359" class="outline-2">
<h2 id="org0a19359"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
ARBEL is a Registry-Based Environment and Language. A <i>registry</i> is a data structure where data is located at "registers".  The data in the registers can be other registries or numbers or strings or code.  It is what other languages might call a <i>map</i> or a <i>table</i>.  Registries are the fundamental data type of ARBEL and the language provides many operations to manipulate and recover values from the registries.  ARBEL instructions operate <i>within</i> a certain registry.  The <i>environment</i> (which registers you can access, and so, which objects and instructions are available) is determined by which registry ARBEL is currently operating within.  Instructions themselves are nothing more than a way to instantiate a new (temporary) registry, execute some code inside of it, and write results to the current registry.  
</p>

<p>
From this basic, but flexible, data type ARBEL builds up a useful system for interactively constructing programs and scripts.  It's goal is to be easy to use interactively which is why the syntax is very similar to entering commands on the command line.  There are commands to save the code you have already entered so that you can interactively build scripts.  It also has commands that make it easy to save state and the registries that you have created to disk so that you can pick up where you left off.
</p>

<p>
The language is imperative and does not try to avoid side-effects (the whole point is to modify the current state of the registry and, perhaps, save it to disk), it is dynamically-typed (registers do not have types, only the values entered in the registries do), and it is strongly typed (values have a certain type and cannot be coerced to other types except explicitly).
</p>

<p>
The best way to get a feel for the language and environment is by example so I will stop the rambling about what the language is like and cut to the code.
</p>
</div>
</div>


<div id="outline-container-org955a4b5" class="outline-2">
<h2 id="org955a4b5"><span class="section-number-2">2</span> The Basics</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org350dc15" class="outline-3">
<h3 id="org350dc15"><span class="section-number-3">2.1</span> Statements and syntax</h3>
<div class="outline-text-3" id="text-2-1">
<p>
A single line of ARBEL code is a statement.  The first element of the statement is one of ARBEL's operators and the other elements are arguments to the operator.  Statements, like sentences, end with periods. For example,
</p>

<pre class="example">
set /hello "Hello, world!" .
</pre>


<p>
<code>set</code> is the ARBEL operation to set a register to a certain value.  Names that have a forward slash (​/) preceeding them are <i>registers</i>, like <code>/hello</code> above. Strings are words enclosed in double quotation marks.  The following demonstrates the other data types in ARBEL:
</p>

<pre class="example">
set /days-in-week 7 .
set /penny 0.01 .
set /facts True .
set /lies False .
set /add-one ( add t 1 . ) .
</pre>

<p>
An Integer is a number without a decimal part, a Real is a number with a decimal part, a Boolean value is one which is either True or False, an Instruction is a collection of one or more statements quoted as code (usually created by enclosing code with open parenthesis, "(" and ")").
</p>

<p>
To use the value located in a registry, simply type the name of the register without the preceeding forward slash.  For example,
</p>
<pre class="example">
... print days-in-week .
7
</pre>

<p>
All code elements must be separated by whitespace in ARBEL including the period that ends the statement and parenthesis.  So it would <i>not</i> be valid to write,
</p>

<pre class="example">
' All are WRONG:
print days-in-week.
set /add-one (add t 1 .) .
</pre>

<p>
There must be space before the period.  There also must be space after and before parenthesis. 
</p>

<p>
There are three parenthesis types in ARBEL: open parentheis ("()"), closed parenthesis ("[]"), and curly parenthesis ("{}").  All contain statements, but they differ in <i>when</i> the statements they contain are executed.
</p>

<ul class="org-ul">
<li><p>
Open parenthesis store the code itself as an Instruction object to be executed later using the operation <code>call</code>.  For example,
</p>
<pre class="example">
... set /add-one ( add t 1 . ) .
... call add-one /t 10 .
ans = 11
</pre>

<p>
<code>call</code> takes an instruction and then assigns each of the registers that you specify to different values. You do not need to declare what arguments a function takes and you can specify any number of registers to set for any Instruction.  For example, 
</p>
<pre class="example">
... set /add-one ( add t 1 . ) .
... call add-one /t 10 .
ans = 11
... call add-one /t 10 /add subtract .
ans = 9
</pre>

<p>
This is a defining feature of ARBEL. Code is automatically generic. Any object in an instruction can be replaced by any other except for a literal value when the Instruction is called.  The person who wrote the code does not need to do anything to allow this.  You can redefine any non-literal in the code by adding <code>/name value</code> in the call to the Instruction.
</p>

<p>
Because there is no ambiguity, you do not actually need to use the <code>call</code> operation directly.  ARBEL will insert it for you if the first argument is an instruction.  So the following would work as well,
</p>
<pre class="example">
... add-one /t 10 .
ans = 11
</pre>

<p>
Instruction objects can also be used in the <code>while</code> looping operation and in several other operations.  Their main purpose is to be evaluated later in a potentially different and separate registry.
</p></li>

<li><p>
Closed parenthesis ("[]") execute the statements inside of them immediately and evaluate to whatever the code sets the <code>/ans</code> register to.  The purpose of these statements is to avoid needing to define temporary registers for intermediate calculations.  For example,
</p>
<pre class="example">
... add [ subtract 5 3 . ] [ multiply 2 3 . ] .
ans = 8
</pre>

<p>
You may have noticed the <code>ans = ...</code> after entering a lot of these commands.  This tells you the current value of the <code>/ans</code> register which is special in ARBEL.  Operations often write to the <code>/ans</code> register in the registry from which they are called.  It is the way to "return" values after calling an operation or instruction.  You can set any value to the <code>/ans</code> register in the current registry by using the <code>answer</code> operation.
</p>
<pre class="example">
... answer 10 .
ans = 10
</pre>

<p>
The <code>/ans</code> register is special because after an Instruction finishes running in its temporary registry.  Whatever the value at the <code>/ans</code> register is in that registry is moved to the <code>/ans</code> register in the registry that called the instruction.  For example,
</p>
<pre class="example">
... set /add-one ( answer [ add t 1 . ] . ) .
... add-one /t 10 .
ans = 11
... print ans .
11
</pre>

<p>
The other reason that the <code>/ans</code> register is special is, as mentioned, closed parenthesis evaluate to the value the statements inside them set the <code>/ans</code> register to.  Because <code>subtract 5 3 .</code> sets the <code>/ans</code> register to <code>2</code> and <code>multiply 2 3 .</code> sets the <code>/ans</code> register to <code>6</code>, <code>add [ subtract 5 3 . ] [ multiply 2 3 . ] .</code> sets the <code>/ans</code> register to <code>8</code>.
</p></li>

<li><p>
Curly parenthesis ("{}") also enclose statements, but those statements are only evaluated <i>if</i> we try to use the value of that expression which is, like for the closed parenthesis, the value the statements set the <code>/ans</code> register to.  This form of evaluation is often called "lazy evaluation". We can think of closed parenthesis as marking expressions we want to "greedily evaluate" and curly parenthesis as marking expressions to "lazily evaluate".  Lazy evaluation is useful for the <code>if</code> operation and other, similar instructions.  For example,
</p>
<pre class="example">
 ... set /gt-4
(
  set /str-t [ to-string t . ] . 
  if [ gt t 4 . ]
     { print [ concat str-t " is greater than 4.\n" . ] . }
     { print [ concat str-t " is less than or equal to 4.\n" . ] . } .
) .
... gt-4 /t 10 .
10 is greater than 4.
... gt-4 /t 3 .
3 is less than or equal to 4.
</pre>

<p>
It works this way because the <code>if</code> operation returns the second value if the first value is <code>True</code> and the third value if the first value is <code>False</code>.  So it tries to access the second value when <code>t</code> is <code>10</code>, executing the statements in the second argument, and similarly for the third argument when <code>t</code> is <code>3</code>.
</p>

<p>
If we had instead used closed parenthesis, both statements would execute everytime regardless of the the truth of the first argument to <code>if</code>.  If we used open parenthesis, an Instruction object would be returned instead of actually doing the printing (the instruction object could be called to actually do the print later).
</p></li>
</ul>

<p>
That is really it as far as syntax is concerned.  Periods terminate statements, parenthesis enclose statements controlling when they are executed, and registers start with a forward slash and their values are obtained by omitting the slash.  We now also know how to define our own instructions and how to call them and how to prepare statements for greedy or lazy evaluation.
</p>
</div>
</div>


<div id="outline-container-orgd71b3f3" class="outline-3">
<h3 id="orgd71b3f3"><span class="section-number-3">2.2</span> Registers and registries</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Zach Flynn</p>
<p class="date">Created: 2019-12-04 Wed 15:03</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
